Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: ## How do you unify imperative and reactive programming?
zh_cn: ## 如何统一指令式编程和响应式编程?

source: ## What are you doing to improve developer joy?
zh_cn: ## 项目会做些什么来提高开发者的乐趣?

source: ## What does Container First mean?
zh_cn: ## 容器优先是什么意思?

source: ## What is GraalVM?
zh_cn: ## 什么是GraalVM？

source: ## What is your view on standards?
zh_cn: ## 对标准有什么考虑?

source: (Only for Oracle GraalVM CE/EE) Install the `native-image` tool using `gu install`:
zh_cn: (仅适用于Oracle GraalVM CE/EE）使用 `gu install` 安装 `native-image` 工具：

source: (Optional) Add the GraalVM `bin` directory to the path
zh_cn: (可选）将GraalVM `bin` 目录添加到路径中

source: (Optional) Set the `JAVA_HOME` environment variable to the GraalVM installation directory.
zh_cn: (可选）将 `JAVA_HOME` 环境变量设置为GraalVM的安装目录。

source: (and similarly `maven.failsafe.plugin` when testing in native image).
zh_cn: (在原生image中测试时也是如此 `maven.failsafe.plugin` )。

source: **For more regarding the use of Jekyll, please refer to the [Jekyll Step by Step Tutorial](https://jekyllrb.com/docs/step-by-step/01-setup/).**
zh_cn: **更多关于使用Jekyll，请参考 [Jekyll循序渐进教程](https://jekyllrb.com/docs/step-by-step/01-setup/).**

source: **Important:** the guides are maintained in the main Quarkus repository and pull requests should be submitted there: https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.
zh_cn: **重要：** 指南保存在主Quarkus仓库中，合并请求应该提交在那里： https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.

source: *Experimental*: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
zh_cn: *Experimental*: 尽早反馈，以使想法更加成熟。在解决方案成熟之前，无法保证平台的稳定性或长期存在。这些扩展正处于其成熟过程的开始阶段。

source: *Multiple consumer applications inside a consumer group*
zh_cn: *一个消费者组内有多个消费者应用程序*

source: *Multiple consumer threads inside a consumer group*
zh_cn: *一个消费者组内使用多个消费者线程*

source: *Preview*: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
zh_cn: *Preview*: 不能保证向后兼容性和在生态系统中的存在。具体的改进可能需要改变配置、API和计划，使之变得 _stable_ 。这些扩展还处于成熟过程的中间阶段。

source: *Pub/Sub: Multiple consumer groups subscribed to a topic*
zh_cn: *发布/订阅：多个消费者群体订阅同一个topic*

source: *Single consumer thread inside a consumer group*
zh_cn: *消费者组内使用单一消费者线程*

source: *Stable*: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
zh_cn: *Stable*: 向后兼容性和在生态系统中的存在被非常重视。应用程序可以安全地依赖于这些扩展。没有标记为预览或实验的扩展(大多数)是稳定的。

source: *dead-letter-cause*: the cause of the failure if any
zh_cn: *dead-letter-cause* ：失败的起因(如果有)。

source: *dead-letter-offset*: the original offset of the record (long mapped to String)
zh_cn: *dead-letter-offset* ：失败记录的原始偏移量(long映射为String)

source: *dead-letter-partition*: the original partition of the record (integer mapped to String)
zh_cn: *dead-letter-partition* ：失败记录的原始分区(integer映射为String)

source: *dead-letter-reason*: the reason of the failure
zh_cn: *dead-letter-reason* ：失败原因

source: *dead-letter-topic*: the original topic of the record
zh_cn: *dead-letter-topic* ：失败记录的原始topic

source: *process* streams of records as they occur or retrospectively.
zh_cn: 对流式记录进行起始或回溯*处理*。

source: *publish* (write) and *subscribe* to (read) streams of events, called _records_.
zh_cn: *发布* (写)以及 *订阅* (读)事件流，称为 _记录_ 。

source: *store* streams of records durably and reliably inside _topics_.
zh_cn: 在 _topic_ 内持久而可靠地 *存储* 流式记录。

source: /guides/security-properties
zh_cn: /guides/security-perties

source: 2020 Awards and Nominations
zh_cn: 2020年奖项及提名

source: 2021 Awards and Nominations
zh_cn: 2021年奖项及提名

source: 2021 Stevie Award
zh_cn: 2021年Stevie奖

source: <a class="anchor" href="#being-reactive"></a>Being reactive
zh_cn: <a class="anchor" href="#being-reactive"></a>响应式风格

source: <a class="anchor" href="#event-driven-architectures"></a>Event-driven Architectures
zh_cn: <a class="anchor" href="#event-driven-architectures"></a>事件驱动的架构

source: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Functions as a Service and Serverless
zh_cn: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>函数作为服务（FaaS）和无服务（Serverless）

source: <a class="anchor" href="#http-microservices"></a>HTTP microservices
zh_cn: <a class="anchor" href="#http-microservices"></a>HTTP微服务

source: <a href="#">62 Contributors</a>
zh_cn: <a href="#">62位贡献者</a>

source: <a href="#">Documentation</a>
zh_cn: <a href="#">文档</a>

source: <a href="#">Extension Repo</a>
zh_cn: <a href="#">扩展版本库</a>

source: <a href="#">JBeret Project</a>
zh_cn: <a href="#">JBeret 项目</a>

source: <a href="#">JBeret makes you jump higher</a>
zh_cn: <a href="#">JBeret让你跳得更高</a>

source: <a href="#">Passing</a>
zh_cn: <a href="#">通过</a>

source: <a href="#">Use Jberet to do something cool</a>
zh_cn: <a href="#">使用Jberet来做一些很酷的事情</a>

source: <a href="/container-first">Container First</a>
zh_cn: <a href="/container-first">容器优先</a>

source: <a href="/container-first">Learn more</a>>
zh_cn: <a href="/container-first">了解更多</a>>

source: <a href="/continuum">Learn more</a>>
zh_cn: <a href="/continuum">了解更多</a>>

source: <a href="/continuum">Unifies imperative and reactive</a>
zh_cn: <a href="/continuum">统一指令式和响应式</a>

source: <a href="/continuum/">Learn more about Reactive</a>
zh_cn: <a href="/continuum/">了解更多关于响应式</a>

source: <a href="/developer-joy">Developer Joy</a>
zh_cn: <a href="/developer-joy">开发者的乐趣</a>

source: <a href="/developer-joy">Learn more</a>>
zh_cn: <a href="/vision/developer-joy">了解更多</a>

source: <a href="/developer-joy/">Learn more about Developer Joy</a>
zh_cn: <a href="/developer-joy/">了解更多关于开发者的乐趣</a>

source: <a href="/kubernetes-native/">Learn more about Kubernetes-native</a>
zh_cn: <a href="/kubernetes-native/">了解更多关于Kubernetes原生</a>

source: <a href="/standards">Community and Standards</a>
zh_cn: <a href="/standards">社区和标准</a>

source: <a href="/standards">Learn more</a>>
zh_cn: <a href="/standards">了解更多</a>>

source: <a href="/standards/">Learn more about Standards</a>
zh_cn: <a href="/standards/">了解更多关于标准</a>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">START CODING</a>
zh_cn: <a href="https://code.quarkus.io" class="button-cta secondary white">开始编码</a>

source: <a href="https://code.quarkus.io">Start Coding</a> with Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]
zh_cn: 运用Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">通告</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">变更日志</a>]<a href="https://code.quarkus.io">开始写代码</a>

source: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">ROADMAP</a>
zh_cn: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">路线图</a>

source: <a href="https://github.com/quarkusio/quarkus/discussions">Go to the Quarkus GitHub Discussions<i class="fas fa-external-link-alt"></i></a>
zh_cn: <a href="https://github.com/quarkusio/quarkus/discussions">进入Quarkus GitHub讨论<i class="fas fa-external-link-alt"></i></a>

source: <a href="https://github.com/quarkusio/quarkus/discussions/categories/events">Check out the "Events" section of Quarkus Discussions</a> for additional community related events.
zh_cn: <a href="https://github.com/quarkusio/quarkus/discussions/categories/events">查看Quarkus讨论组的”活动“部分</a> 参与其他社区相关活动。

source: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BROWSE EXTENSIONS</a>
zh_cn: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extenions/' %}active{% endif %}">浏览扩展</a>

source: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">Red Hat Support</a>
zh_cn: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">红帽技术支持</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">More Information</a>
zh_cn: <a href="{{ site.data.versions.quarkus.announce }}">更多信息</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">Read the release notes</a>
zh_cn: <a href="{{ site.data.versions.quarkus.announce }}">阅读发布说明</a>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
zh_cn: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">QUARKUS是什么？</a>

source: <a href="{{site.baseurl}}/blog" class="{% if page.url contains '/blog/' %}active{% endif %}">BLOG</a>
zh_cn: <a href="{{site.baseurl}}/blog" class="{% if page.url contains '/blog/' %}active{% endif %}" >博客</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
zh_cn: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">书籍</a>

source: <a href="{{site.baseurl}}/catalog">Extension Catalog</a> <i class="fas fa-chevron-right"></i> {{ page.title }}
zh_cn: <a href="{site.baseurl}}/catalog">扩展目录</a> <i class="fas fa-chevron-right"></i> {{ page.title }}

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
zh_cn: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">容器优先 </a>

source: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVE</a>
zh_cn: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">响应式</a>

source: <a href="{{site.baseurl}}/createextensions"> Learn How </a>
zh_cn: <a href="{{site.baseurl}}/createextensions"> 了解如何 </a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
zh_cn: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">开发者的乐趣 </a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
zh_cn: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">讨论</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
zh_cn: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">活动</a>

source: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USE EXTENSIONS</a>
zh_cn: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">使用扩展</a>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
zh_cn: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">入门</a>

source: <a href="{{site.baseurl}}/get-started/" class="button-cta">Get Started with Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Read the Guides</a>
zh_cn: <a href="{{site.baseurl}}/get-started/" class="button-cta">开始体验Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">阅读指南</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTATION</a>
zh_cn: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}" >指南</a>

source: <a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
zh_cn: <a href="{{site.baseurl}}/guides/cli-tooling">阅读CLI工具指南</a>

source: <a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
zh_cn: <a href="{site.baseurl}}/guides/continuous-testing">阅读持续测试指南</a>

source: <a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
zh_cn: <a href="{site.baseurl}}/guides/dev-services">阅读开发服务指南</a>

source: <a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
zh_cn: <a href="{site.baseurl}}/guides/dev-ui">阅读开发用户界面指南</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Read the Dev Mode guide</a>
zh_cn: <a href="{site.baseurl}}/guides/maven-tooling#dev-mode/">阅读开发模式指南</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
zh_cn: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">阅读远程开发模式指南</a>

source: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREATE EXTENSIONS</a>
zh_cn: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}" >创建扩展</a>

source: <a href="{{site.baseurl}}/insights" class="{% if page.url contains '/insights/' %}active{% endif %}">PODCAST</a>
zh_cn: <a href="{{site.baseurl}}/insights" class="{% if page.url contains '/insights/' %}active{% endif %}" >播客</a>

source: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES NATIVE</a>
zh_cn: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES 原生</a>

source: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">NEWSLETTER</a>
zh_cn: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">新闻</a>

source: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" TIP VIDEOS</a>
zh_cn: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" TIP视频</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
zh_cn: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">标准</a>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
zh_cn: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">支持</a>

source: <a href="{{site.baseurl}}/worldtour/">Learn more about the Quarkus World Tour</a>
zh_cn: <a href="{{site.baseurl}}/worldtour/">了解更多关于Quarkus世界巡演的信息</a>

source: <code>chunk</code> - A simple Job that reads, processes, and stores data from a file.
zh_cn: <code>chunk</code> - 一个简单的作业，从文件中读取、处理和存储数据。

source: <code>jdbc-repository</code> - A Job that uses a jdbc datasource to store JBeret and Job metadata.
zh_cn: <code>jdbc-repository</code> - 一个使用jdbc数据源来存储JBeret和作业元数据的作业。

source: <code>scheduler</code> - Schedule a Job to run every 10 seconds
zh_cn: <code>scheduler</code> - 调度一个作业，每10秒运行一次

source: <span href="https://quarkus.io/extensions/">Extensions<i class="fas fa-chevron-down"></i></span>
zh_cn: <span href="https://quarkus.io/extensions/">扩展<i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/community/">Community<i class="fas fa-chevron-down"></i></span>
zh_cn: <span href="{{site.baseurl}}/community/">社区 <i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/learn/">Learn<i class="fas fa-chevron-down"></i></span>
zh_cn: <span href="{{site.baseurl}}/learn/">学习 <i class="fas fa-chevron-down"></i></span>

source: > If you encounter any unexpected errors during the above, please refer to the [troubleshooting](https://jekyllrb.com/docs/troubleshooting/#configuration-problems) page or the [requirements](https://jekyllrb.com/docs/installation/#requirements) page, as you might be missing development headers or other prerequisites.
zh_cn: > 如果您在上述过程中遇到任何意外错误，请参阅 [排错](https://jekyllrb.com/docs/troubleshooting/#configuration-problems) 页面或者 [需求](https://jekyllrb.com/docs/installation/#requirements) 页面，因为您可能会错过开发headers或其他先决条件。

source: @PermitAll is a JSR 250 common security annotation that indicates that the given endpoint is accessible by any caller, authenticated or not.
zh_cn: @PermitAll是JSR 250的一个通用安全注解，它表明给定的端点可以被任何调用者访问，无论是否经过验证。

source: @RolesAllowed is a JSR 250 common security annotation that indicates that the given endpoint is accessible by a caller if they have either a "User" or "Admin" role assigned.
zh_cn: @RolesAllowed是一个JSR 250通用安全注解，表明如果调用者分配了 "用户 "或 "管理员 "角色，那么他们可以访问给定的端点。

source: A Job can also be scheduled programmatically, using the JobScheduler API and the Quarkus startup event:
zh_cn: 作业也可以通过程序安排，使用JobScheduler API和Quarkus的启动事件：

source: A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.
zh_cn: Kubernetes Native Java栈为OpenJDK HotSpot和GraalVM量身定制，从Java库和标准中精心打造。

source: A `MutinyEmitter` to send message to a channel, so it can be easily integrated with the Mutiny API exposed by Hibernate Reactive or Hibernate Reactive with Panache.
zh_cn: `MutinyEmitter` 会向 channel 发送消息，所以它可以很容易地与Hibernate Reactive或Hibernate Reactive with Panache所暴露的Mutiny API进行集成。

source: A `RuntimeException` crossing the transaction boundaries will rollback the transaction.
zh_cn: 一个 `RuntimeException` ，越过事务边界，将回滚交易。

source: A `persistOrUpdate()` method exist that persist or update an entity in the database, it uses the __upsert__ capability of MongoDB to do it in a single query.
zh_cn: 存在一个 `persistOrUpdate()` 方法来持久化或更新数据库中的实体，它使用MongoDB的 __upsert__ 功能在单个查询中完成此操作。

source: A cohesive platform for optimized developer joy with unified configuration and no hassle native executable generation. Zero config, live reload in the blink of an eye and streamlined code for the 80% common usages, flexible for the remainder 20%.
zh_cn: 一个内聚的平台，优化开发人员的乐趣，统一的配置和没有麻烦的本地可执行文件生成。零配置，瞬间重新加载，简化80%的常用代码，灵活处理剩余的20%。

source: A cohesive platform for optimized developer joy:
zh_cn: 一个优化开发者乐趣的有凝聚力的平台：

source: A comma-separated list of host:port to use for establishing the initial connection to the Kafka cluster. Type: _string_
zh_cn: 用逗号分隔的主机：端口列表，用于建立与Kafka集群的初始连接。 类型: _string_

source: A custom `bootstrap` script
zh_cn: 一个自定义的 `bootstrap` 脚本

source: A given Panache entity can be attached to only a single persistence unit.
zh_cn: 一个Panache实体类只能配置到一个持久化单元。

source: A high level overview of what the various steps of a CI/CD pipeline would look is the following:
zh_cn: 以下是对CI/CD管道的各个步骤的高度概述：

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[resource] is a representation of the entity that is producing telemetry, it adds attributes to the exported trace to characterize who is producing the trace.
zh_cn: Opentelemetry link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[资源] 是产生telemetry的实体的表示，它向输出的trace中添加属性，用以描述谁在产生trace。

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[sampler] decides whether a trace should be sampled and exported, controlling noise and overhead by reducing the number of sample of traces collected and sent to the collector.
zh_cn: Opentelemetry link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[采样器] 决定了是否应该对一个trace进行采样和输出，通过减少收集和发送至exporter的trace样本数量来控制噪音和开销。

source: A key to used when writing the record Type: _string_
zh_cn: 写入记录时使用的键值 类型: _string_

source: A leading slash will change how the configured permission path is interpreted. The configured URL will be used as-is, and paths will not be adjusted if the value of `quarkus.http.root-path` is changed. For example:
zh_cn: 所有前置的斜杠将改变配置的权限路径的解释方式。配置的URL将按原样使用，并且如果 `quarkus.http.root-path` 的值改变后路径将不会被调整。例如：

source: A list of all extensions that support Dev Services and their configuration options.
zh_cn: 所有支持开发服务的扩展及其配置选项的列表。

source: A minimal configuration for the Kafka connector with an incoming channel looks like the following:
zh_cn: 一个配有消息接收channel的Kafka connector的最小配置如下所示：

source: A more advanced option would be to directly provide a bean of `javax.json.bind.JsonbConfig` (with a `Dependent` scope) or in the extreme case to provide a bean of type `javax.json.bind.Jsonb` (with a `Singleton` scope). If the latter approach is leveraged it is very important to manually inject and apply all `io.quarkus.jsonb.JsonbConfigCustomizer` beans in the CDI producer that produces `javax.json.bind.Jsonb`. Failure to do so will prevent JSON-B specific customizations provided by various extensions from being applied.
zh_cn: 一个更高级的选择是直接提供一个 `javax.json.bind.JsonbConfig` 的bean（具有 `Dependent` 范围），或者在极端情况下，提供一个 `javax.json.bind.Jsonb` 的bean（具有 `Singleton` 范围）。如果采用后一种方法，那么在产成 `javax.json.bind.Jsonb` 的CDI生产者中手动注入和应用所有 `io.quarkus.jsonb.JsonbConfigCustomizer` Bean是非常重要的。如果不这样做，就会阻止由各种扩展提供的JSON-B特定的自定义功能被应用。

source: A periodical video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem. View the <a href="{{site.baseurl}}/insights">live podcasts</a> and check out older episodes on the Podcasts.
zh_cn: 由Quarkus开发者主持的定期视频播客，讲述Quarkus生态系统内和周边事物。查看<a href="{{site.baseurl}}/insights">实时播客</a>，并在播客中查看先前的内容。

source: A port value of zero will result in a randomly assigned port.
zh_cn: 端口值为零将导致随机分配端口。

source: A reactive MongoDB Client is included in Quarkus. Using it is as easy as using the classic MongoDB Client. You can rewrite the previous example to use it like the following.
zh_cn: Quarkus中包含一个响应式MongoDB客户端。使用它就像使用经典的MongoDB客户端一样简单。你可以重写前面的例子来使用它，如下所示：

source: A running Redis server, or Docker Compose to start one
zh_cn: 一个正在运行的Redis服务，也可以使用Docker Compose启动一个Redis服务。

source: A sample configuration should look like this:
zh_cn: 示例配置应如下所示：

source: A starter template has been generated for both JVM and native execution modes.
zh_cn: 已经为JVM和原生执行模式生成了一个启动模板。

source: A unique string that identifies the consumer group the application belongs to. If not set, defaults to the application name as set by the `quarkus.application.name` configuration property. If that is not set either, a unique, generated id is used. It is recommended to always define a `group.id`, the automatic generation is only a convenient feature for development. You can explicitly ask for automatically generated unique id by setting this property to `${quarkus.uuid}`. Type: _string_
zh_cn: 一个唯一的字符串，用于识别应用程序所属的消费者组。 如果未设置, 那么默认为通过 `quarkus.application.name` 所设定的应用程序名称。 如果这个属性也没有设置，那么会使用一个生成的唯一的id。 建议总是设置一个 `group.id`，因为自动生成只是一个方便在开发模式中使用的特性。 你可以通过将该属性设置为 `${quarkus.uuid}` 来显示的获取自动生成的唯一的id。 类型: _string_
